#include "includes.h"

/****************************************************************************************
 * 函数名     ：Timer1_Init
 * 函数功能：16位定时器1初始化,使用PP2 PP1，重载计数	1*500=500us
 * 入口参数：无
 * 返回          ：无
****************************************************************************************/
void Timer1_Init(void)
{
	T1CTL2 = T1CLK_SEL_SCLK|T1CLK_Prescale_DIV_8;	//	32m/4 /8
	T1H=0;
	T1L=0;
	PP2=0x01;		//5000
	PP1=0xf4-1;
	PWMMODE = 1;	//使能重载

//	PP2=0x01;		//500-1 PP2=0x01
//	PP1=0xf4-1;		//PP1=0xF4-1
	_NOP();
	T1ON = 1;		//T1定时器启动
	T1IF = 0;
	T1IE = 1;
}
